src/openforms/registrations/contrib/stuf_zds/tests/files/vcr_cassettes/StufZDSPluginPaymentVCRTests/StufZDSPluginPaymentVCRTests.test_set_zaak_payment.yaml

interactions:
- request:
    body: "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soapenv:Envelope\n    xmlns:soapenv=\"http://www.w3.org/2003/05/soap-envelope\"\n
      \   xmlns:StUF=\"http://www.egem.nl/StUF/StUF0301\"\n    xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\n>\n
      \   <soapenv:Header>\n        \n\n    </soapenv:Header>\n    <soapenv:Body>\n
      \       \n\n<ZKN:zakLk01 xmlns:ZKN=\"http://www.egem.nl/StUF/sector/zkn/0310\">\n
      \   <ZKN:stuurgegevens>\n        <StUF:berichtcode>Lk01</StUF:berichtcode>\n
      \       <StUF:zender>\n    <StUF:organisatie>zender_organisatie-4</StUF:organisatie>\n<StUF:applicatie>zender_applicatie-4</StUF:applicatie>\n<StUF:administratie>zender_administratie-4</StUF:administratie>\n<StUF:gebruiker>zender_gebruiker-4</StUF:gebruiker>\n\n</StUF:zender>\n<StUF:ontvanger>\n
      \   <StUF:organisatie>ontvanger_organisatie-4</StUF:organisatie>\n<StUF:applicatie>ontvanger_applicatie-4</StUF:applicatie>\n<StUF:administratie>ontvanger_administratie-4</StUF:administratie>\n<StUF:gebruiker>ontvanger_gebruiker-4</StUF:gebruiker>\n\n</StUF:ontvanger>\n<StUF:referentienummer>f2e3dcd5-3e00-4470-bbbf-dbbd103a3cbb</StUF:referentienummer>\n<StUF:tijdstipBericht>20250630085425</StUF:tijdstipBericht>\n\n
      \       <StUF:entiteittype>ZAK</StUF:entiteittype>\n    </ZKN:stuurgegevens>\n
      \   <ZKN:parameters>\n        <StUF:mutatiesoort>W</StUF:mutatiesoort>\n        <StUF:indicatorOvername>V</StUF:indicatorOvername>\n
      \   </ZKN:parameters>\n    <ZKN:object StUF:verwerkingssoort=\"W\" StUF:entiteittype=\"ZAK\">\n
      \       <ZKN:identificatie>1234</ZKN:identificatie>\n        <ZKN:betalingsIndicatie>Geheel</ZKN:betalingsIndicatie>\n
      \       <ZKN:laatsteBetaaldatum>20250630</ZKN:laatsteBetaaldatum>\n        <StUF:extraElementen>\n\n<StUF:extraElement
      naam=\"language_code\">en</StUF:extraElement>\n\n<StUF:extraElement naam=\"payment_completed\">true</StUF:extraElement>\n\n<StUF:extraElement
      naam=\"payment_amount\">40.0</StUF:extraElement>\n\n<StUF:extraElement naam=\"payment_public_order_ids.0\">foo</StUF:extraElement>\n\n<StUF:extraElement
      naam=\"payment_public_order_ids.1\">bar</StUF:extraElement>\n\n<StUF:extraElement
      naam=\"provider_payment_ids.0\">123456</StUF:extraElement>\n\n<StUF:extraElement
      naam=\"provider_payment_ids.1\">654321</StUF:extraElement>\n\n</StUF:extraElementen>\n\n\n
      \   </ZKN:object>\n</ZKN:zakLk01>\n    </soapenv:Body>\n</soapenv:Envelope>\n"
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate, br
      Connection:
      - keep-alive
      Content-Length:
      - '2262'
      Content-Type:
      - application/soap+xml
      SOAPAction:
      - http://www.egem.nl/StUF/sector/zkn/0310/updateZaak_Lk01
      User-Agent:
      - python-requests/2.32.2
    method: POST
    uri: http://localhost/stuf-zds
  response:
    body:
      string: "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soapenv:Envelope xmlns:soapenv=\"http://www.w3.org/2003/05/soap-envelope\">\n
        \   <soapenv:Header/>\n    <soapenv:Body>\n        <StUF:Bv03Bericht xmlns:StUF=\"http://www.egem.nl/StUF/StUF0301\"\n
        \                         xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\n
        \                         xsi:schemaLocation=\"http://www.egem.nl/StUF/StUF0301
        stuf0301.xsd\">\n            <StUF:stuurgegevens>\n                <StUF:berichtcode>Bv03</StUF:berichtcode>\n
        \               <StUF:zender>\n                    <StUF:organisatie>KING</StUF:organisatie>\n
        \                   <StUF:applicatie>STP</StUF:applicatie>\n                    <StUF:gebruiker/>\n
        \               </StUF:zender>\n                <StUF:ontvanger>\n                    <StUF:organisatie>ORG</StUF:organisatie>\n
        \                   <StUF:applicatie>TTA</StUF:applicatie>\n                    <StUF:gebruiker/>\n
        \               </StUF:ontvanger>\n                <!-- NOTE: these mock values
        are meaningless -->\n                <StUF:referentienummer>7771605337</StUF:referentienummer>\n
        \               <StUF:tijdstipBericht>20210520125824</StUF:tijdstipBericht>\n
        \               <StUF:crossRefnummer>abeab17b-03cb-477b-95af-410f07947f40</StUF:crossRefnummer>\n
        \           </StUF:stuurgegevens>\n        </StUF:Bv03Bericht>\n    </soapenv:Body>\n</soapenv:Envelope>"
    headers:
      Connection:
      - close
      Content-Length:
      - '1349'
      Content-Type:
      - text/xml
      Date:
      - Mon, 30 Jun 2025 08:54:25 GMT
      Server:
      - Werkzeug/3.1.3 Python/3.12.11
    status:
      code: 200
      message: OK
version: 1
